In [73]:
import pandas as pd

In [74]:
df_dim = pd.read_csv('2015_2.csv')
df_dim

      l   w   h
0     3  11  24
1    13   5  19
2     1   9  27
3    24   8  21
4     6   8  17
..   ..  ..  ..
995  30  12  18
996  29  11  20
997   3  12  15
998  24  25  17
999  14   6  11

[1000 rows x 3 columns]

In [75]:
df_dim['area1'] = 2*df_dim['l']*df_dim['w'] 
df_dim['area2'] = 2*df_dim['w']*df_dim['h']
df_dim['area3'] = 2*df_dim['h']*df_dim['l']
df_dim['area'] = df_dim['area1'] + df_dim['area2'] + df_dim['area3']
df_dim['extra'] = df_dim[['area1','area2','area3']].min(axis=1)/2
df_dim

      l   w   h  area1  area2  area3  area  extra
0     3  11  24     66    528    144   738   33.0
1    13   5  19    130    190    494   814   65.0
2     1   9  27     18    486     54   558    9.0
3    24   8  21    384    336   1008  1728  168.0
4     6   8  17     96    272    204   572   48.0
..   ..  ..  ..    ...    ...    ...   ...    ...
995  30  12  18    720    432   1080  2232  216.0
996  29  11  20    638    440   1160  2238  220.0
997   3  12  15     72    360     90   522   36.0
998  24  25  17   1200    850    816  2866  408.0
999  14   6  11    168    132    308   608   66.0

[1000 rows x 8 columns]

In [76]:
df_dim['total'] = df_dim['area'] + df_dim['extra']
df_dim

      l   w   h  area1  area2  area3  area  extra   total
0     3  11  24     66    528    144   738   33.0   771.0
1    13   5  19    130    190    494   814   65.0   879.0
2     1   9  27     18    486     54   558    9.0   567.0
3    24   8  21    384    336   1008  1728  168.0  1896.0
4     6   8  17     96    272    204   572   48.0   620.0
..   ..  ..  ..    ...    ...    ...   ...    ...     ...
995  30  12  18    720    432   1080  2232  216.0  2448.0
996  29  11  20    638    440   1160  2238  220.0  2458.0
997   3  12  15     72    360     90   522   36.0   558.0
998  24  25  17   1200    850    816  2866  408.0  3274.0
999  14   6  11    168    132    308   608   66.0   674.0

[1000 rows x 9 columns]

In [77]:
df_dim['total'].sum()

1588178.0

In [78]:
df_2 = df_dim[['l','w','h']]
df_2

      l   w   h
0     3  11  24
1    13   5  19
2     1   9  27
3    24   8  21
4     6   8  17
..   ..  ..  ..
995  30  12  18
996  29  11  20
997   3  12  15
998  24  25  17
999  14   6  11

[1000 rows x 3 columns]

In [174]:
df_number = pd.DataFrame()

In [175]:
for i in range (0,1000):
    list_number = df_2.iloc[i:i+1, :]
    list_number = list_number.values.tolist()
    list_number = list_number[0]
    list_number = sorted(list_number)
    df_sort = pd.DataFrame(list_number).transpose()
    df_number = df_number.append(df_sort) 
df_number

     0   1   2
0    3  11  24
0    5  13  19
0    1   9  27
0    8  21  24
0    6   8  17
..  ..  ..  ..
0   12  18  30
0   11  20  29
0    3  12  15
0   17  24  25
0    6  11  14

[1000 rows x 3 columns]

In [176]:
df_number['ribon'] = df_number[0] + df_number[0] + df_number[1]  + df_number[1] 
df_number

     0   1   2  ribon
0    3  11  24     28
0    5  13  19     36
0    1   9  27     20
0    8  21  24     58
0    6   8  17     28
..  ..  ..  ..    ...
0   12  18  30     60
0   11  20  29     62
0    3  12  15     30
0   17  24  25     82
0    6  11  14     34

[1000 rows x 4 columns]

In [177]:
df_number['bow'] = df_number[0]*df_number[1]*df_number[2]
df_number

     0   1   2  ribon    bow
0    3  11  24     28    792
0    5  13  19     36   1235
0    1   9  27     20    243
0    8  21  24     58   4032
0    6   8  17     28    816
..  ..  ..  ..    ...    ...
0   12  18  30     60   6480
0   11  20  29     62   6380
0    3  12  15     30    540
0   17  24  25     82  10200
0    6  11  14     34    924

[1000 rows x 5 columns]

In [178]:
df_number['total'] = df_number['ribon'] + df_number['bow']
df_number

     0   1   2  ribon    bow  total
0    3  11  24     28    792    820
0    5  13  19     36   1235   1271
0    1   9  27     20    243    263
0    8  21  24     58   4032   4090
0    6   8  17     28    816    844
..  ..  ..  ..    ...    ...    ...
0   12  18  30     60   6480   6540
0   11  20  29     62   6380   6442
0    3  12  15     30    540    570
0   17  24  25     82  10200  10282
0    6  11  14     34    924    958

[1000 rows x 6 columns]

In [181]:
df_number['total'].sum()

3783758